from django.shortcuts import render
from django.http import HttpResponse

# Create your views here.
def home(request):
    context = {
        'articles': [
            {
                'title': 'در مزارع استخراج زیرزمینی بیت کوین در چین چه می‌گذرد؟',
                'img': 'https://digiato.com/wp-content/uploads/2021/12/0.0.jpg',
                'description': """«بِن» (Ben) در زمینه استخراج زیرزمینی بیت کوین در استان سیچوآن چین فعالیت دارد و هر روز را به امید دستگیر نشدن توسط نهادهای دولتی سپری می‌کند. او مانند بسیاری دیگر از فعالان این عرصه، پس از وضع قانون ممنوعیت استخراج در اوایل سال ۲۰۲۱، مجبور شده است کار خود را به صورت غیرمجاز ادامه دهد و از راه‌هایی خلاقانه برای جلوگیری از شناسایی شدن بهره می‌گیرد.

تجهیزات استخراج بن در چندین محل متفاوت پخش شده است تا میزان مصرف برق بالای آن‌ها موجب لو رفتن عملیات غیرقانونی نشود. وی همچنین به طور مستقیم از منابع تامین برق کوچک محلی انرژی دریافت می‌کند تا مجبور به استفاده از شبکه‌های قدرتمندتر سراسری نشود. تمهیداتی نیز برای پوشاندن ردپای دیجیتال او در نظر گرفته شده است. بن در مصاحبه با نشریه CNBC اشاره کرده که همیشه از راه‌هایی برای دور زدن محدودیت‌ها جهت ادامه حیات کسب و کار خود در چین بهره می‌برده است؛ اما در شش ماه اخیر مخاطرات به شکل چشمگیری افزایش داشته است. از نظر وی، معلوم نیست که دولت چین تا چه حدی در متوقف کردن فرایندهای استخراج رمز ارزها پیشروی می‌کند."""
            },
            {
                'title': 'اپل تولید این محصولات را در سال 2021 متوقف کرد',
                'img': 'https://digiato.com/wp-content/uploads/2022/01/apple-homepod-discontinued.jpg',
                'description': 'اپل در سال جاری دستگاه‌های جدیدی از جمله آی‌مک 24 اینچی یا چهار مدل آیفون 13را برای طرفداران خود معرفی کرد. با این وجود، کوپرتینویی‌ها مجبور شدند تا با برخی از محصولات دیگر خود نیز خداحافظی کنند. در ادامه پنج دستگاه و لوازم جانبی اپل را مرور خواهیم کرد که تولید آن‌ها در سال 2021 متوقف شد.'
            },
            {
                'title': 'چگونه استیکر واتساپ بسازیم؟',
                'img': 'https://digiato.com/wp-content/uploads/2021/12/stickerly-and-whatsapp-stickers-app-on-iphone-and-android.jpg',
                'description': 'واتساپ محبوب‌ترین پیام‌رسان جهان است و افراد بی‌شماری در طول روز برای ارسال پیام و تماس‌های صوتی و تصویری از آن استفاده می‌کنند. یکی از راه‌های برقراری ارتباط، استفاده از استیکر است که محبوبیت بالایی هم دارد. در این مطلب نحوه ساخت استیکر واتساپ با موبایل در سیستم عامل‌های اندروید و iOS و همچنین کامپیوتر را آموزش می‌دهیم.'
            }
        ]
    }
    return render(request, 'blog/home.html', context)